#include "sdlgamecontroller.h"
#include <SDL2/SDL.h>
#include <SDL2/SDL_events.h>
#include <SDL2/SDL_gamecontroller.h>
#include <chrono>
#include <set>
#include <string>

bool SdlGameController::sdlInit = false;

Napi::FunctionReference SdlGameController::constructor;

Napi::Object SdlGameController::Init(Napi::Env env, Napi::Object exports) {
  Napi::HandleScope scope(env);

  Napi::Function func =
    DefineClass(env, "SdlGameController",
                {InstanceMethod("pollEvents", &SdlGameController::pollEvents),
                 InstanceMethod("enableGyroscope",
                                &SdlGameController::enableGyroscope),
                 InstanceMethod("enableAccelerometer",
                                &SdlGameController::enableAccelerometer),
                 InstanceMethod("setLeds", &SdlGameController::setLeds),
                 InstanceMethod("rumble", &SdlGameController::rumble),
                 InstanceMethod("rumbleTriggers",
                                &SdlGameController::rumbleTriggers)});

  constructor = Napi::Persistent(func);
  constructor.SuppressDestruct();

  exports.Set("SdlGameController", func);

  return exports;
}

SdlGameController::SdlGameController(const Napi::CallbackInfo &info)
    : Napi::ObjectWrap<SdlGameController>(info), poll_number(0) {
  if (info.Length() > 0) {
    Napi::Object config = info[0].As<Napi::Object>();
    Napi::Value value = config.Get("sdl_joystick_rog_chakram");
    auto sdl_joystick_rog_chakram = value.ToBoolean();
    if (sdl_joystick_rog_chakram)
      this->hints.insert("sdl_joystick_rog_chakram");
  }
}

/* PS5 trigger effect documentation:
   https://controllers.fandom.com/wiki/Sony_DualSense#FFB_Trigger_Modes
*/
typedef struct {
  Uint8 ucEnableBits1;              /* 0 */
  Uint8 ucEnableBits2;              /* 1 */
  Uint8 ucRumbleRight;              /* 2 */
  Uint8 ucRumbleLeft;               /* 3 */
  Uint8 ucHeadphoneVolume;          /* 4 */
  Uint8 ucSpeakerVolume;            /* 5 */
  Uint8 ucMicrophoneVolume;         /* 6 */
  Uint8 ucAudioEnableBits;          /* 7 */
  Uint8 ucMicLightMode;             /* 8 */
  Uint8 ucAudioMuteBits;            /* 9 */
  Uint8 rgucRightTriggerEffect[11]; /* 10 */
  Uint8 rgucLeftTriggerEffect[11];  /* 21 */
  Uint8 rgucUnknown1[6];            /* 32 */
  Uint8 ucLedFlags;                 /* 38 */
  Uint8 rgucUnknown2[2];            /* 39 */
  Uint8 ucLedAnim;                  /* 41 */
  Uint8 ucLedBrightness;            /* 42 */
  Uint8 ucPadLights;                /* 43 */
  Uint8 ucLedRed;                   /* 44 */
  Uint8 ucLedGreen;                 /* 45 */
  Uint8 ucLedBlue;                  /* 46 */
} DS5EffectsState_t;

bool SdlGameController::SendEffect(SDL_GameController *gamecontroller) {
#if SDL_VERSION_ATLEAST(2, 0, 14)
  if (SDL_GameControllerGetType(gamecontroller) != SDL_CONTROLLER_TYPE_PS5)
    return SDL_FALSE;

  Uint8 clear[11] = {0x05, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
  DS5EffectsState_t state;
  SDL_zero(state);
  state.ucEnableBits1 |=
    (0x04 | 0x08); /* Modify right and left trigger effect respectively */
  SDL_memcpy(state.rgucRightTriggerEffect, clear, sizeof(clear));
  SDL_memcpy(state.rgucLeftTriggerEffect, clear, sizeof(clear));
  auto success =
    SDL_GameControllerSendEffect(gamecontroller, &state, sizeof(state)) == 0;
  return success;
#else
  (void) gamecontroller;
  return SDL_FALSE;
#endif
}

SDL_GameController *SdlGameController::AddController(const int device_index,
                                                     Napi::Object *obj) {
